Union_3/src/Catalogs/СерверыПриложений1С/СерверыПриложений1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыПриложений1С</name>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Защищен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКластера</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

Union_3/src/Catalogs/СерверыПриложений1С/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеИдентификатора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИдентификаторПолученНажатие(Элемент)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Адрес) Тогда
		Сообщить("Не заполнен адрес сервера", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.Порт) Тогда
		Сообщить("Не заполнен порт сервера", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;
	
	Если Не Отказ Тогда
		Объект.ИдентификаторКластера = КомандыУтилитыRAS.ПолучитьИдентификатор(Объект.Адрес, Объект.Порт);
		ОбновитьОтображениеИдентификатора()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИдентификатора()

	Если Не ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		Элементы.ДекорацияИдентификаторПолучен.Заголовок = "<Получить идентификатор>";
		Элементы.ДекорацияИдентификаторПолучен.Доступность = Истина;	
	Иначе
		Элементы.ДекорацияИдентификаторПолучен.Заголовок = "Идентификатор получен";
		Элементы.ДекорацияИдентификаторПолучен.Доступность = Ложь;
	КонецЕсли;	
		
КонецПроцедуры
